app/controllers/home_controller.rb

SELECT "markets".* FROM "markets"
---
def index
  @markets = Market.all