app/controllers/markets_controller.rb

SELECT "markets".* FROM "markets"
---
  def index
    @markets = Market.all

SELECT  "markets".* FROM "markets" WHERE "markets"."id" = ?  ORDER BY "markets"."id" ASC LIMIT 1  [["id", 1]]
SELECT "vendors".* FROM "vendors" WHERE "vendors"."market_id" = ?  [["market_id", 5]]
---
  def show
    @market = Market.where(id: params[:id]).first
    @vendors = Vendor.where(market_id: params[:id])

INSERT INTO "markets" ("name", "address", "city", "county", "state", "zip", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @market = Market.new(market_create_params[:market])  #use the params that you accept
    if @market.save                         #save will return true if it DID save

SELECT  "markets".* FROM "markets" WHERE "markets"."id" = ? LIMIT 1  [["id", 93]]
---
  def edit
    @market = Market.find(params[:id])

SELECT  "markets".* FROM "markets" WHERE "markets"."id" = ? LIMIT 1  [["id", 93]]
UPDATE "markets" SET "name" = ?, "updated_at" = ? WHERE "markets"."id" = ?  [["name", "Ania's Awesome Market"], ["updated_at", "2016-04-29 16:23:16.903327"], ["id", 93]]
---
  def update
    @market = Market.find(params[:id])
    @market.update(market_update_params[:market])