app/controllers/products_controller.rb

  def index
    @products = Product.where(vendor_id: params[:vendor_id])
---
SELECT "products".* FROM "products" WHERE "products"."vendor_id" = ?  [["vendor_id", 1]]

  def show
    @products = Product.all.where(params[:vendor_id])
---
SELECT "products".* FROM "products" WHERE (1)

  def edit
    @vendor = Vendor.find(params[:vendor_id])
    @product = @vendor.products.find(params[:id])
---
SELECT  "vendors".* FROM "vendors" WHERE "vendors"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "products".* FROM "products" WHERE "products"."vendor_id" = ? AND "products"."id" = ? LIMIT 1  [["vendor_id", 1], ["id", 1]]

  def update
    @vendor = Vendor.find(params[:vendor_id])
    @product = @vendor.products.find(params[:id])
    @product.update(product_update_params)
---
SELECT  "vendors".* FROM "vendors" WHERE "vendors"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "products".* FROM "products" WHERE "products"."vendor_id" = ? AND "products"."id" = ? LIMIT 1  [["vendor_id", 1], ["id", 1]]
UPDATE "products" SET "name" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "Wet Beets"], ["updated_at", "2016-04-28 22:19:03.753858"], ["id", 1]]

  def new
    @vendor = Vendor.find(params[:vendor_id])
---
SELECT  "vendors".* FROM "vendors" WHERE "vendors"."id" = ?  ORDER BY "vendors"."id" ASC LIMIT 1  [["id", 1]]

  def create
    @vendor = Vendor.find(params[:vendor_id])
    @product = @vendor.products.new(product_params)
      if  @product.save
---
SELECT  "vendors".* FROM "vendors" WHERE "vendors"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "products" ("name", "vendor_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", ""], ["vendor_id", 1], ["created_at", "2016-04-28 21:30:00.872784"], ["updated_at", "2016-04-28 21:30:00.872784"]]

  def destroy
    @vendor = Vendor.find(params[:vendor_id])
    @product = @vendor.products.find(params[:id])
    @product.destroy
---
SELECT  "vendors".* FROM "vendors" WHERE "vendors"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "products".* FROM "products" WHERE "products"."vendor_id" = ? AND "products"."id" = ? LIMIT 1  [["vendor_id", 1], ["id", 1]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 1]]