app/controllers/sales_controller.rb

  def index
    @sales = Sale.where(vendor_id: params[:vendor_id])
    @sales_month = Sale.where(vendor_id: params[:vendor_id]).where(purchase_time: (Time.now.beginning_of_month..Time.now.end_of_month))
---
SELECT "sales".* FROM "sales" WHERE "sales"."vendor_id" = ?  [["vendor_id", 1]]
SELECT "sales".* FROM "sales" WHERE "sales"."vendor_id" = ? AND ("sales"."purchase_time" BETWEEN '2016-04-01 07:00:00.000000' AND '2016-05-01 06:59:59.999999')  [["vendor_id", 1]]

  def new
    @vendor = Vendor.find(params[:vendor_id])
    @products = Product.where(vendor_id: params[:vendor_id])
---
SELECT  "vendors".* FROM "vendors" WHERE "vendors"."id" = ? LIMIT 1  [["id", 5]]
SELECT "products".* FROM "products" WHERE "products"."vendor_id" = ?  [["vendor_id", 1]]

  def create
    @vendor = Vendor.find(params[:vendor_id])
    @sale = @vendor.sales.new(sales_params)
      if  @sale.save
---
SELECT  "vendors".* FROM "vendors" WHERE "vendors"."id" = ? LIMIT 1  [["id", 5]]
INSERT INTO "sales" ("amount", "purchase_time", "product_id", "vendor_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["amount", 3], ["purchase_time", "2016-03-03 00:00:00.000000"], ["product_id", 1], ["vendor_id", 1], ["created_at", "2016-04-29 21:58:10.027996"], ["updated_at", "2016-04-29 21:58:10.027996"]]