app/controllers/vendors_controller.rb

INSERT INTO "vendors" ("name", "no_of_employees", "market_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Sarah"], ["no_of_employees", "70"], ["market_id", 1], ["created_at", "2016-04-29 17:39:44.451408"], ["updated_at", "2016-04-29 17:39:44.451408"]]
---
  def create
    @vendor = Vendor.new(vendor_create_params[:vendor])
    if @vendor.save

SELECT  "vendors".* FROM "vendors" WHERE "vendors"."id" = ? LIMIT 1  [["id", 469]]
DELETE FROM "vendors" WHERE "vendors"."id" = ?  [["id", 469]]
---
  def destroy
    @vendor = Vendor.find(params[:id])
    if @vendor.destroy

SELECT  "vendors".* FROM "vendors" WHERE "vendors"."id" = ? LIMIT 1  [["id", 7]]
---
  def edit
    @vendor = Vendor.find(params[:id])

SELECT  "vendors".* FROM "vendors" WHERE "vendors"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "vendors" SET "name" = ?, "market_id" = ?, "updated_at" = ? WHERE "vendors"."id" = ?  [["name", "Feil-FarrellX"], ["market_id", nil], ["updated_at", "2016-04-29 17:45:23.061967"], ["id", 1]]
---
  def update
    @vendor = Vendor.find(params[:id])
    if @vendor.update(vendor_create_params[:vendor])