app/views/markets/show.html.erb

SELECT "vendors".* FROM "vendors" WHERE "vendors"."market_id" = ?  [["market_id", 5]]
---
  <div class='list'>
    <% @market.vendors.each do |vendor| %>