app/views/sales/index.html.erb

    <%else%>
      <%= @products.find(sale.product_id).name%></span>
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 202]]